{
  "aboutPageTitle": "About Course Selection Community Platform",
  "aboutPageSubtitle": "An open-source project dedicated to enhancing course selection efficiency and experience for university students.",
  "problemStatementTitle": "The Pain Point of Fragmented Course Information",
  "problemStatement": "In recent years, universities and colleges have been offering students an increasingly rich and diverse selection of courses. However, this has been accompanied by an explosive growth in the amount of course information. Students can only gain a preliminary understanding of courses from brief course outlines. To delve deeper into course content, teaching styles, grading methods, and even evaluations and exam information from past students, they often need to collect and compare information from various online forums themselves.\nTaking Tunghai University as an example, although its course information website presents course outlines and introductions categorized by departments, the detailed course opening information is scattered and lacks integration. Students need to spend a lot of time comparing and understanding information across different pages. Furthermore, the course selection system interface of Tunghai University's student information system only lists course codes for students to sort their preferences, lacking intuitive course time information and real-time conflict checking. When selecting courses, students must separately refer to the course schedule, manually eliminate conflicts, and plan their course selection preferences. The course selection process is cumbersome and the user experience is poor.\nIn summary, the current course selection process relies too heavily on students independently consolidating fragmented course information. Information gaps and operational inconveniences greatly reduce course selection efficiency and student satisfaction.",
  "motivationTitle": "Project Motivation",
  "motivationText": "During university course selection periods, students are often陷 in the dilemma of information fragmentation. To select ideal courses, they must frequently switch between multiple platforms such as the official school website, course evaluation forums, and social media, painstakingly piecing together course information. This phenomenon of information asymmetry not only consumes a lot of students' time and energy, but may also lead to suboptimal course selection decisions due to insufficient information.\nIn view of this, we hope to develop an open-source course forum system that integrates course information, student evaluations, and teacher perspectives on a single platform. By establishing a course selection community that shares information and breaks down information barriers, university students can more conveniently obtain comprehensive and truthful course information as a reference for course selection, and thus select courses that truly meet their interests and needs.\nIn addition, current course selection systems have relatively basic interface functions when filling out pre-selection course forms, lacking user-friendly time scheduling assistance. This project also hopes to optimize the course selection system interface, provide richer information presentation and more intuitive operation methods, such as visualized timetables and real-time conflict prompts, to help students plan their course schedules more efficiently.\nIn short, this project aims to create a student-centered, information-integrated, and user-friendly course selection auxiliary system to enhance the overall course selection experience, and hopes to promote this system to more universities and colleges through an open-source model, benefiting a wider student population.",
  "objectiveTitle": "Project Objectives",
  "objectiveText": "This project aims to develop a course selection community platform with the core goal of improving course selection efficiency and reducing information gaps at Tunghai University. The specific objectives are as follows:\nBuild a student exchange community to promote information sharing: Through the platform, provide course discussion forums and evaluation systems, gather diverse student perspectives and real-time evaluations of courses, break down information barriers, and help students understand course content and learning directions more comprehensively. At the same time, encourage teachers to participate in discussions, establish an interactive communication space between teachers and students, and improve the utilization rate of teaching resources.\nOptimize the course selection process and improve scheduling efficiency: Design a simulated course selection scheduling system to visualize course timetables and provide real-time conflict detection functions to help users intuitively plan their personal timetables, reduce the complexity of course selection schedule planning, and improve course selection efficiency.\nIntegrate course selection resources to create a single entry point: Integrate course information, course selection systems, and discussion communities into a single platform to simplify students' access to course selection information, reduce the hassle of switching between multiple platforms, and optimize the user experience.\nReduce university IT development and maintenance costs and improve administrative efficiency: By promoting this system through an open-source model, it is expected to reduce the repetitive investment of universities in course selection system development and maintenance, improve the overall administrative efficiency of universities, and utilize resources more effectively to improve teaching quality.\nIn summary, this project hopes to optimize the course selection process of Tunghai University through the introduction of information technology, which will not only improve students' course selection efficiency and satisfaction, but also further reduce IT costs and improve administrative efficiency for the school, achieving the goal of cost reduction and efficiency enhancement.",
  "targetUsersTitle": "Target User Group",
  "targetUsersText": "The primary target users of this platform are students of Tunghai University. We hope that through this platform, students of Tunghai University can more efficiently and conveniently obtain the course information they need when selecting courses, and make course selection decisions that better meet their own needs. At the same time, we also hope to promote this platform to more universities and colleges in the future, benefiting a wider student population."
}